YanqiS/stm32temp1/main.c
uint8_t lvLED_Sts_TPRobot, lvLED_Sts_LIN, lvLED_Sts_CAN, lvLED_Sts_Sensor; // 0 grey,	1	green,	2	oragne,	3	red

////LIN
uint8_t DataReceiveflag;
uint8_t DataProcess;
uint8_t ReceivePID, ReceiveID;
uint8_t FrameReceiveOverFlag;
uint8_t LinReceiveData[9];
uint8_t ReceiveData, SendCheckSum, ReceiveCheckSum;
uint8_t DtRxProcess;

#define CANMsg_MNumb		32
FDCAN_TxHeaderTypeDef CAN_TxHeader[CANMsg_MNumb];
FDCAN_TxHeaderTypeDef FDCAN_TxHeader[CANMsg_MNumb];

// 添加调试用的全局变量
uint8_t DEBUG_CAN_Up = 0xFF;    // 0xFF表示未收到数据
uint8_t DEBUG_CAN_Down = 0xFF;
uint8_t DEBUG_CAN_RX_Flag = 0;  // 收到新数据标志
uint8_t DEBUG_LIN_Byte1 = 0;     // LIN打包后的Byte1
uint8_t DEBUG_LIN_Pack_Flag = 0; // 打包完成标志
uint8_t DEBUG_LIN_Checksum = 0;

uint8_t DEBUG_UART_RX_Count = 0;      // UART接收计数
uint8_t DEBUG_ReceiveID = 0;          // 收到的ID
uint8_t DEBUG_ReceivePID = 0;         // 最近收到的PID字节
uint8_t DEBUG_LIN_Send_Count = 0;     // LIN发送计数
uint8_t DEBUG_DataProcess = 0;        // DataProcess状态
uint8_t DEBUG_CAN_104_Count = 0;      // 收到0x104的计数
uint16_t DEBUG_RID22_Count = 0;       // 识别到RID 0x22的累计次数
uint16_t DEBUG_RID34_Count = 0;       // 识别到RID 0x34的累计次数
uint16_t DEBUG_RID35_Count = 0;       // 识别到RID 0x35的累计次数
uint16_t DEBUG_RID36_Count = 0;       // 识别到RID 0x36的累计次数
uint16_t EBSBatVol_raw = 16383;           // 14bit raw, 16383 means invalid per LDF
uint8_t EBSVolSts_raw = 0;                // 2bit status, 0=No_error
uint8_t EBSBatCrntRng_raw = 0;            // 2bit status, 0=±1A range
uint8_t EBSBatIncnstncyFlag_raw = 0;      // 1bit, 0=no error
uint8_t EBSRespEr_raw = 0;                // 1bit, response error

//////// ////////app level

//Motor Control
struct MotorCtrl_TypeDef MotorCtrl_M1, MotorCtrl_M2, MotorCtrl_M3, MotorCtrl_M4;
uint16_t HostID = 0x01;
uint16_t M1_ID = 0x0D1;        //D1	D2,	X
uint16_t M2_ID = 0x0D2;        //D1	D2,	X
uint16_t M3_ID = 0x0D3;        //D3	D4,	Y
uint16_t M4_ID = 0x0D5;        //D5,	Z

uint8_t MotorInit_M1, MotorInit_M2, MotorInit_M3, MotorInit_M4;
bool MotorERR_M1, MotorERR_M2, MotorERR_M3, MotorERR_M4;

#define XmaxLimit 	600		//290
#define YmaxLimit 	600		//435

//#define RCtrl_Mode_0m1p		1

//#define DispX0 	100		////#define DispX1 	120		////#define DispY0 	100		////#define DispY1 	120		//
//uint8_t	DispX0[4],DispX1[4],DispY0[4],DispY1[4];
//int	DispX0_32b,DispX1_32b,DispY0_32b,DispY1_32b;

struct ScreenSize_TypeDef ScreenSz_1;

//web232
struct Ser2CAN_Msg_TypeDef Ser2CAN_Msg[CANMsg_MNumb];
struct SerLoCtrl_Msg_TypeDef SerLoCtrl_Msg;
struct Bench_AckInfo_TypeDef Bench_Info;

//TA531
struct TA531_env_TypeDef TA531SysEnv;
struct TA531_TimCallback_TypeDef TA531TimCallback;
struct TA531_RobotCtrl_TypeDef TA531_RC1;

struct TA531_GP_IN_TypeDef TA531_GP_IN;
struct TA531_Door_TypeDef TA531_Door;
uint8_t TSA_GP_IN_DATA[8];

uint8_t TA531_RC1_fg; // 0-Error;	1-no task;	2-command received;	3-command accomplish;
uint8_t TA531_RC1_x_ready, TA531_RC1_y_ready, TA531_RC1_z_ready;
uint8_t TA531_RC1_Ack, TA531_Lock;

//stm32 header

FDCAN_TxHeaderTypeDef CAN_TxHeader[CANMsg_MNumb];
FDCAN_TxHeaderTypeDef FDCAN_TxHeader[CANMsg_MNumb];

FDCAN_TxHeaderTypeDef MotrCtrl_1_TxHeader, MotrCtrl_2_TxHeader,
		MotrCtrl_3_TxHeader, MotrCtrl_4_TxHeader;
FDCAN_RxHeaderTypeDef FDCAN1_RxHeader, FDCAN2_RxHeader, MotrCtrl_1_RxHeader,
		MotrCtrl_2_RxHeader, MotrCtrl_3_RxHeader;
FDCAN_FilterTypeDef FDCAN_Filter1[28], FDCAN_Filter2[28]; //
FDCAN_TxHeaderTypeDef TSA_Ack_Header, TSA1_ADC_Header, TSA2_LS_Header,
		TSA_Ack_RC_Header, TSA_GP_IN_Header;
FDCAN_TxHeaderTypeDef TSA_Door_Relay_Header;
uint8_t TSA_Door_Relay_DATA[8];
//communication

uint8_t CH1RxData[8], CH2RxData[8];
uint8_t CH1TxData[8], CH2TxData[8], TSA1_ADC_DATA[8], TSA2_LS_DATA[8],
		TSA_Ack_DATA[8], TSA_Ack_RC_DATA[8];
uint8_t SWS_0x00_Data[9], SWS_0x02_Data[9], HOD_0x0_Data[9], EBS_0x0_Data[9],
		EBS_0x1_Data[9], EBS_0x2_Data[9], IFP_0x0_Data[9];
uint8_t SWS_0x22_Data[9]; //G3.0
bool SWS_0x00_Flag, SWS_0x02_Flag, HOD_0x0_Flag, EBS_0x0_Flag, IFP_0x0_Flag,
		SWS_0x22_Flag;
uint8_t MotrCtrl_1_DATA[8], MotrCtrl_2_DATA[8], MotrCtrl_3_DATA[8],
		MotrCtrl_4_DATA[8];

uint8_t I2CRxData[REC_LENGTH];
uint8_t u1RxData[REC_LENGTH], u2RxData[REC_LENGTH], u3RxData[REC_LENGTH],
		u4RxData[REC_LENGTH], u5RxData[REC_LENGTH], u6RxData[REC_LENGTH],
		RxData[REC_LENGTH];
uint8_t Serial_TxData[REC_LENGTH] = { 0 };
uint8_t Bench_Info_TxData[REC_LENGTH] = { 0 };

struct TA531_LIN_GW_TypeDef TA531_LIN_GW;
struct TA531_LIN_SWS_TypeDef TA531_LIN_SWS;
struct TA531_LIN_SWS_G3_TypeDef TA531_LIN_SWS_G3;

uint32_t len;

bool rxflag;
bool U1RXFlag = 0, U2RXFlag = 0, U3RXFlag = 0, U4RXFlag = 0, U5RXFlag = 0,
		U6RXFlag = 0;

bool TSA3_0x52_Flag = 0, TSA4_0x53_Flag = 0, TSA4_0x54_Flag = 0,
		TSA4_0x103_Flag = 0, TSA4_0x104_Flag = 0;

////////TMP1075
float temp1075_ZXD, temp1075_ZPD, temp1075_LHZCU, temp1075_RHZCU, temp1075_RZCU,
		temp1075_Bk1, temp1075_Bk2, temp1075_Bk3;
uint8_t temp1075_ZXD_i, temp1075_ZPD_i, temp1075_LHZCU_i, temp1075_RHZCU_i,
		temp1075_RZCU_i, temp1075_Bk1_i, temp1075_Bk2_i, temp1075_Bk3_i;
uint8_t temp1075_ZXD_f, temp1075_ZPD_f, temp1075_LHZCU_f, temp1075_RHZCU_f,
		temp1075_RZCU_f, temp1075_Bk1_f, temp1075_Bk2_f, temp1075_Bk3_f;
bool temper_flag;

uint32_t adc_value;
uint32_t mVoltage;

struct TA531_Door_TypeDef {
	uint8_t Door_FL;        // 左前门：0-无动作, 1-开, 2-关, 3-保持
	uint8_t Door_FR;        // 右前门
	uint8_t Door_RL;        // 左后门
	uint8_t Door_Hood;      // 引擎盖
	uint8_t Door_Trunk;     // 后备箱
	uint8_t Door_Reserve;
};

// ========== 电机保护系统 ==========
struct Motor_Protection_TypeDef {
	int16_t last_X_pos;
	int16_t last_Y_pos;
	int8_t X_direction_changes;
	int8_t Y_direction_changes;
	uint16_t stuck_counter;
	uint16_t movement_timeout;
	uint32_t last_progress_tick;
	uint8_t protection_triggered;
	uint8_t error_type;
	uint32_t total_errors;
};

struct Motor_Protection_TypeDef Motor_Protection;

#define MOTOR_PROTECTION_ENABLED        1
#define MAX_DIRECTION_CHANGES          3
#define MAX_STUCK_COUNT               8
#define MAX_MOVEMENT_TIMEOUT         100
#define MOVE_WAIT_TIMEOUT_MS        8000
#define MOVE_WAIT_TIMEOUT_INIT_MS   15000
#define POSITION_TOLERANCE             5
#define REACH_POSITION_TOLERANCE       2
#define MAX_MOVEMENT_TIMEOUT_MS (MAX_MOVEMENT_TIMEOUT * MOTOR_WAIT_POLL_MS)
// ==================================

/* USER CODE END PV */

