YanqiS/stm32temp1/main.c
					HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);	//F
					TA531_RC1.TA531_RC_Z_code2 = TA531_RC1.TA531_RC_Z_code;	// 0
					TA531_RC1.TA531_RC_X_Mov = 0;
					TA531_RC1.TA531_RC_Y_Mov = 0;

					TA531_RC1.TA531_RC_Z_code = 0;
				}

					// 固定优先级：XY -> XYMov/ZCode -> Reset（仅当前序列完成后才允许Reset）
					if ((TA531_RC1.TA531_RC_Reset == 1) && rc_action_ready_for_reset) {
					Motor_Protection_Reset();  // ← 新增
					Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act; // ← 新增
					Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act; // ← 新增

					TA531_RC1.TA531_RC_X_trg = 0;
					TA531_RC1.TA531_RC_Y_trg = 0;
					MotoCtrl_PositionLoop(0, 0);
					HAL_Delay(500);

					// 检查复位是否成功（可选）
					if (abs(TA531_RC1.TA531_RC_X_act) > 10
							|| abs(TA531_RC1.TA531_RC_Y_act) > 10) {
						Motor_Protection.protection_triggered = 1;
						Motor_Protection.error_type = 2;
						Motor_Protection_EmergencyStop();
					}
				}

				TA531_RC1_fg = 3;
				TA531_Lock = 0;
				TA531_RC1.TA531_RC_Reset = 0;  // 清除复位标志 ← 关键！
				TA531_RC1.TA531_RC_Z_code = 0; // 清除Z轴动作标志
				TA531_RC1.TA531_RC_X_Mov = 0;  // 清除移动偏移
				TA531_RC1.TA531_RC_Y_Mov = 0;  // 清除移动偏移
				// ==============================================

				TSA_Ack_RC_DATA[0] = TA531_RC1_Ack & 0x0f;
				TSA_Ack_RC_DATA[3] = TA531_RC1.TA531_RC_X_act & 0xff;
				TSA_Ack_RC_DATA[4] = (TA531_RC1.TA531_RC_X_act >> 8) & 0xff;
				TSA_Ack_RC_DATA[5] = TA531_RC1.TA531_RC_Y_act & 0xff;
				TSA_Ack_RC_DATA[6] = (TA531_RC1.TA531_RC_Y_act >> 8) & 0xff;
				TSA_Ack_RC_DATA[7] = 0xff;

				HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Ack_RC_Header,
						TSA_Ack_RC_DATA);
				lvLED_Sts_TPRobot = 1;
			}

			if (TA531_Lock == 0) {
				if ((SW_UP == 1) & (SW_UP_pre == 1)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go X+");
					TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + 50;
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_UP == 1) & (SW_UP_pre == 0)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go X+");
					TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act + 20;
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_DW == 1) & (SW_DW_pre == 1)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go X-");
					TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - 50;

					if (TA531_RC1.TA531_RC_X_trg < 0) {
						TA531_RC1.TA531_RC_X_trg = 0;
					}
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_DW == 1) & (SW_DW_pre == 0)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go X-");
					TA531_RC1.TA531_RC_X_trg = TA531_RC1.TA531_RC_X_act - 20;

					if (TA531_RC1.TA531_RC_X_trg < 0) {
						TA531_RC1.TA531_RC_X_trg = 0;
					}
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_LEFT == 1) & (SW_LEFT_pre == 1)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go Y-");
					TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - 50;

					if (TA531_RC1.TA531_RC_Y_trg < 0) {
						TA531_RC1.TA531_RC_Y_trg = 0;
					}
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_LEFT == 1) & (SW_LEFT_pre == 0)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go Y-");
					TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act - 20;

					if (TA531_RC1.TA531_RC_Y_trg < 0) {
						TA531_RC1.TA531_RC_Y_trg = 0;
					}
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_RIGHT == 1) & (SW_RIGHT_pre == 1)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go Y+");
					TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act + 50;
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if ((SW_RIGHT == 1) & (SW_RIGHT_pre == 0)) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Go Y+");
					TA531_RC1.TA531_RC_Y_trg = TA531_RC1.TA531_RC_Y_act + 20;
					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg, false);  // ← 添加限制
					TA531_RC1_fg = 2;
				} else if (SW_BUTTON == 1) {
					OLED_ShowString(OLED_I2C_ch, OLED_type, 10, 1, "Push!");

					TA531_RC1.TA531_RC_Z_code = 1;
					TA531_RC1.TA531_RC_Z_code2 = 0;

					TA531_RC1_fg = 2;
				}
			}

		}	//	end if MoC

/////////// XL9555
//	    uint8_t XL9555_tempdata;
//	    XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 0);
//		itoa(XL9555_tempdata,str1,2);
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 3, str1);
//
//	    XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 1);
//		itoa(XL9555_tempdata,str1,2);
//		OLED_ShowString(OLED_I2C_ch ,OLED_type,8, 3, str1);
//
//
//		//TSA_GP_IN_DATA

		///////// Light Sensor
		uint8_t *light_a[4] = { &TA531SysEnv.TA531_env_LightA1,
				&TA531SysEnv.TA531_env_LightA2, &TA531SysEnv.TA531_env_LightA3,
				&TA531SysEnv.TA531_env_LightA4, };
		uint8_t *light_d[4] = { &TA531SysEnv.TA531_env_LightD1,
				&TA531SysEnv.TA531_env_LightD2, &TA531SysEnv.TA531_env_LightD3,
				&TA531SysEnv.TA531_env_LightD4, };

		for (uint8_t i = 0; i < 4; i++) {
			*light_a[i] = NormalizeLightSensor(adc_buffer[i]);
			*light_d[i] = EncodeLightAlarm(*light_a[i]);
		}

//	TSA1_ADC_DATA[8], TSA2_LS_DATA[8]

		TSA2_LS_DATA[0] = (TA531SysEnv.TA531_env_LightD1 & 0x03)
				+ ((TA531SysEnv.TA531_env_LightD2 & 0x03) << 2)
				+ ((TA531SysEnv.TA531_env_LightD3 & 0x03) << 4)
				+ ((TA531SysEnv.TA531_env_LightD4 & 0x03) << 6);
		TSA2_LS_DATA[2] = TA531SysEnv.TA531_env_LightA1 & 0xff;
		TSA2_LS_DATA[3] = TA531SysEnv.TA531_env_LightA2 & 0xff;
		TSA2_LS_DATA[4] = TA531SysEnv.TA531_env_LightA3 & 0xff;
		TSA2_LS_DATA[5] = TA531SysEnv.TA531_env_LightA4 & 0xff;

//		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA2_LS_Header, TSA2_LS_DATA);

