YanqiS/stm32temp1/main.c
//////////ADC
		TA531SysEnv.TA531_env_ADC1 = adc_buffer[4] * 0.056;
		TA531SysEnv.TA531_env_ADC2 = adc_buffer[5] * 0.056;	//*32.50 / 4096 /1.65 *11.65;

		TSA1_ADC_DATA[0] = TA531SysEnv.TA531_env_ADC1 & 0xff;
		TSA1_ADC_DATA[1] = TA531SysEnv.TA531_env_ADC2 & 0xff;

		//	HAL_Delay(20);

		if (id1 == 0)	//id1 = 0, no RC
				{
			OLED_UpdatePage_Id0(oled_line);
		}

		if (TSA3_0x52_Flag == 1) {
			if (TA531SysEnv.TA531_env_KL15 == 1) {
				HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//F
//				char *str = "*KL15 Relay ON";
//				OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 2, str );
			} else if (TA531SysEnv.TA531_env_KL15 == 0) {
				HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);
			}

			if (TA531SysEnv.TA531_env_USB1 == 0) {
				HAL_GPIO_WritePin(USB_RELAY_1_GPIO_Port, USB_RELAY_1_Pin, 0);//F
			} else if (TA531SysEnv.TA531_env_USB1 == 1) {
				HAL_GPIO_WritePin(USB_RELAY_1_GPIO_Port, USB_RELAY_1_Pin, 1);
				HAL_GPIO_WritePin(USB_RELAY_2_GPIO_Port, USB_RELAY_2_Pin, 0);
			} else if (TA531SysEnv.TA531_env_USB1 == 2) {
				HAL_GPIO_WritePin(USB_RELAY_1_GPIO_Port, USB_RELAY_1_Pin, 1);
				HAL_GPIO_WritePin(USB_RELAY_2_GPIO_Port, USB_RELAY_2_Pin, 1);
			}

			// 1			//		TA531SysEnv.TA531_env_KeyLock = (buf_rec[2]>>0)&0x03;
			if ((TA531SysEnv.TA531_env_KeyLock == 0)
					& (TA531TimCallback.TA531_Callback_flag[1] == 0)) {
				HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port, COM_RELAY_1_Pin, 0);//F
			} else if (TA531SysEnv.TA531_env_KeyLock == 3) {
				HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port, COM_RELAY_1_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyLock == 1)	//1s
					{
//				uint8_t TA531_Callback_flag[8] ;
//				uint8_t TA531_Callback_key[8] ;
//				uint32_t TA531_Callback_tim[8] ;

				HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port, COM_RELAY_1_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[1] = 1;
				TA531TimCallback.TA531_Callback_tim[1] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port, COM_RELAY_1_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[1] = 1;
				TA531TimCallback.TA531_Callback_tim[1] = Sys_TIM_TICK + 6000;
			}

			// 2			//		TA531SysEnv.TA531_env_KeyUnlock = (buf_rec[2]>>2)&0x03;
			if ((TA531SysEnv.TA531_env_KeyUnlock == 0)
					& (TA531TimCallback.TA531_Callback_flag[2] == 0)) {
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 0);//F
			} else if (TA531SysEnv.TA531_env_KeyUnlock == 3) {
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyUnlock == 1)	//1s
					{
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 1);
//				//TA531TimCallback
				TA531TimCallback.TA531_Callback_flag[2] = 1;
				TA531TimCallback.TA531_Callback_tim[2] = Sys_TIM_TICK + 1500;
			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port, COM_RELAY_2_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[2] = 1;
				TA531TimCallback.TA531_Callback_tim[2] = Sys_TIM_TICK + 6000;
			}

			// 3		//		TA531SysEnv.TA531_env_KeyRearDoor = (buf_rec[2]>>4)&0x03;
			if ((TA531SysEnv.TA531_env_KeyRearDoor == 0)
					& (TA531TimCallback.TA531_Callback_flag[3] == 0)) {
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 0);//F
			} else if (TA531SysEnv.TA531_env_KeyRearDoor == 3) {
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 1);
			} else if (TA531SysEnv.TA531_env_KeyRearDoor == 1)	//1s
					{
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[3] = 1;
				TA531TimCallback.TA531_Callback_tim[3] = Sys_TIM_TICK + 1500;

			} else if (TA531SysEnv.TA531_env_KeyLock == 2)	//6s
					{
				HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port, COM_RELAY_3_Pin, 1);
//				//TA531TimCallback

				TA531TimCallback.TA531_Callback_flag[3] = 1;
				TA531TimCallback.TA531_Callback_tim[3] = Sys_TIM_TICK + 6000;
			}

			// 4		//		TA531SysEnv.TA531_env_KeyBeep = (buf_rec[2]>>6)&0x03;

			// 5		//		TA531SysEnv.TA531_env_KeyWindow = (buf_rec[3]>>0)&0x03;

			// 6		//		TA531SysEnv.TA531_env_KeyLeftDoor = (buf_rec[3]>>2)&0x03;

			// 7		//		TA531SysEnv.TA531_env_KeyRightDoor = (buf_rec[3]>>4)&0x03;

			if (TA531SysEnv.TA531_env_Relay1 == 1)	//			A Y_RELAY_1_Pin
					{
				HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay1 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay2 == 1)	//
					{
				HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay2 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay3 == 1)	//
					{
				HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay3 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay4 == 1)	//
					{
				HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay4 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay5 == 1)	//			B
					{
				HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay5 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 1);
			}

			if (TA531SysEnv.TA531_env_Relay6 == 1)	//			B
					{
				HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 0);	//F
			} else if (TA531SysEnv.TA531_env_Relay6 == 2) {
				HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 1);
			}

			TSA_Ack_DATA[3] = 0xff;
			TSA3_0x52_Flag = 0;
		}

		if (TSA4_0x53_Flag == 1) {

