YanqiS/stm32temp1/main.c
					TSA_Ack_DATA[4] = 1;
					TSA4_0x53_Flag = 1;
				} else if (FDCAN1_RxHeader.Identifier == 0x054)	//TSA_PWM
						{
					TA531SysEnv.TA531_env_PWM_Ag_1 = (buf_rec[0] >> 0) & 0xFF;
					TA531SysEnv.TA531_env_PWM_Ag_2 = (buf_rec[1] >> 0) & 0xFF;
					TA531SysEnv.TA531_env_PWM_Ag_3 = (buf_rec[2] >> 0) & 0xFF;
					TA531SysEnv.TA531_env_PWM_Ag_4 = (buf_rec[3] >> 0) & 0xFF;

					if (TA531SysEnv.TA531_env_PWM_Ag_1 == 0) {
						TA531SysEnv.TA531_env_PWM_Ag_1 = ((buf_rec[4] >> 0)
								& 0x03) * 90;
					}
					if (TA531SysEnv.TA531_env_PWM_Ag_2 == 0) {
						TA531SysEnv.TA531_env_PWM_Ag_2 = ((buf_rec[4] >> 2)
								& 0x03) * 90;
					}
					if (TA531SysEnv.TA531_env_PWM_Ag_3 == 0) {
						TA531SysEnv.TA531_env_PWM_Ag_3 = ((buf_rec[4] >> 4)
								& 0x03) * 90;
					}
					if (TA531SysEnv.TA531_env_PWM_Ag_4 == 0) {
						TA531SysEnv.TA531_env_PWM_Ag_4 = ((buf_rec[4] >> 6)
								& 0x03) * 90;
					}

					TA531SysEnv.TA531_env_PWM_Ag_5 = (buf_rec[5] >> 0)
							& 0x03 * 90;
					TA531SysEnv.TA531_env_PWM_Ag_6 = (buf_rec[5] >> 2)
							& 0x03 * 90;
					TA531SysEnv.TA531_env_PWM_Ag_7 = (buf_rec[5] >> 4)
							& 0x03 * 90;
					TA531SysEnv.TA531_env_PWM_Ag_8 = (buf_rec[5] >> 6)
							& 0x03 * 90;

					TSA_Ack_DATA[4] = 1;
					TSA4_0x54_Flag = 1;
				} else if (FDCAN1_RxHeader.Identifier == 0x103)	//TSA_LIN_SWS G2.5
						{
					TA531_LIN_SWS.LIN_SWS2_ErrRespSWS_1 = (buf_rec[0] >> 0)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS2_RespErSWSF_1 = (buf_rec[0] >> 1)
							& 0x01;

					TA531_LIN_SWS.LIN_SWS_CCSwStsDistIncSwA_1 =
							(buf_rec[0] >> 4) & 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsCCASwA_1 = (buf_rec[0] >> 5)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_PfTrTapUpDwnSecySwSta_2 = (buf_rec[0]
							>> 6) & 0x03;

					TA531_LIN_SWS.LIN_SWS_CCSwStsSwDataIntgty_2 = (buf_rec[1]
							>> 0) & 0x03;
					TA531_LIN_SWS.LIN_SWS_CCSwStsSpdDecSwA_1 = (buf_rec[1] >> 2)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsSetSwA_1 = (buf_rec[1] >> 3)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsRsmSwA_1 = (buf_rec[1] >> 4)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsOnSwA_1 = (buf_rec[1] >> 5)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsDistDecSwA_1 =
							(buf_rec[1] >> 6) & 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsCanclSwA_1 = (buf_rec[1] >> 7)
							& 0x01;

					TA531_LIN_SWS.LIN_SWS_SWSFastrUserSwA_1 = (buf_rec[2] >> 0)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSEntrtnUserSwA_1 = (buf_rec[2] >> 1)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSCnfmSwA_1 = (buf_rec[2] >> 2)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_StrgWhlTipcSwDataIntgty_1 =
							(buf_rec[2] >> 3) & 0x01;
					TA531_LIN_SWS.LIN_SWS_StrgWhlEntrtnSwDtIntgty_1 =
							(buf_rec[2] >> 4) & 0x01;
					TA531_LIN_SWS.LIN_SWS_StrgWhlDrMdSwDtIntgty_1 = (buf_rec[2]
							>> 5) & 0x01;
					TA531_LIN_SWS.LIN_SWS_StrgWhlDrvngMdSwA_1 =
							(buf_rec[2] >> 6) & 0x01;
					TA531_LIN_SWS.LIN_SWS_CCSwStsSpdIncSwA_1 = (buf_rec[2] >> 7)
							& 0x01;

					TA531_LIN_SWS.LIN_SWS_SWSFnChngSwA_1 = (buf_rec[3] >> 0)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSSelDwnSwA_1 = (buf_rec[3] >> 1)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSSelLSwA_1 = (buf_rec[3] >> 2)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSSelRSwA_1 = (buf_rec[3] >> 3)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSSelUpSwA_1 = (buf_rec[3] >> 4)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSSocContSwA_1 = (buf_rec[3] >> 5)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_SWSVcSwA_1 = (buf_rec[3] >> 6) & 0x01;
					TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve01_1 = (buf_rec[3]
							>> 7) & 0x01;

					TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve02_8 = (buf_rec[4]
							>> 0) & 0xff;

					TA531_LIN_SWS.LIN_SWS_SWSLFnChngSwA_1 = (buf_rec[5] >> 0)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve03_7 = (buf_rec[5]
							>> 1) & 0x7f;

					TSA_Ack_DATA[5] = 1;
					TSA4_0x103_Flag = 1;
					lvLED_Sts_LIN = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x104)	//TSA_LIN_SWS G3.0
						{
					// 解析CAN数据

					TA531_LIN_SWS_G3.CCSwStsAlvRC_l = (buf_rec[1] >> 0) & 0x0f;
					TA531_LIN_SWS_G3.SWSSelUpSwAL_l = (buf_rec[1] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSSelDwnSwAL_l = (buf_rec[1] >> 6) & 0x03;

					DEBUG_CAN_Up = TA531_LIN_SWS_G3.SWSSelUpSwAL_l;
					DEBUG_CAN_Down = TA531_LIN_SWS_G3.SWSSelDwnSwAL_l;
					DEBUG_CAN_RX_Flag = 1;  // 标记收到新数据
					DEBUG_CAN_104_Count++;

					TA531_LIN_SWS_G3.SWSSelLSwAL_l = (buf_rec[2] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSSelRSwAL_l = (buf_rec[2] >> 2) & 0x03;
					TA531_LIN_SWS_G3.SWSCnfmSwAL_l = (buf_rec[2] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSPB1SwAL_l = (buf_rec[2] >> 6) & 0x03;

					TA531_LIN_SWS_G3.SWSPB2SwAL_l = (buf_rec[3] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSPB3SwAL_l = (buf_rec[3] >> 2) & 0x03;
					TA531_LIN_SWS_G3.SWSSelUpSwReq_l = (buf_rec[3] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSSelDwnSwReq_l = (buf_rec[3] >> 6)
							& 0x03;

					TA531_LIN_SWS_G3.SWSSelLSwReq_l = (buf_rec[4] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSSelRSwReq_l = (buf_rec[4] >> 2) & 0x03;
					TA531_LIN_SWS_G3.SWSCnfmSwReq_l = (buf_rec[4] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSPB1SwReq_l = (buf_rec[4] >> 6) & 0x03;

					TA531_LIN_SWS_G3.SWSPB2SwReq_l = (buf_rec[5] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSPB3SwReq_l = (buf_rec[5] >> 2) & 0x03;
					TA531_LIN_SWS_G3.PfTrTapUpDwnSecySwSta_l = (buf_rec[5] >> 4)
							& 0x03;
					TA531_LIN_SWS_G3.PadSSelLSwA_l = (buf_rec[5] >> 6) & 0x03;

					TA531_LIN_SWS_G3.PadSSelRSwA_l = (buf_rec[6] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSSelLSwStuckL_l = (buf_rec[6] >> 2)
							& 0x01;
					TA531_LIN_SWS_G3.SWSSelRSwStuckL_l = (buf_rec[6] >> 3)
							& 0x01;
					TA531_LIN_SWS_G3.SWSCnfmSwStuckL_l = (buf_rec[6] >> 4)
							& 0x01;
					TA531_LIN_SWS_G3.SWSPB1SwStuckL_l = (buf_rec[6] >> 5)
							& 0x01;
					TA531_LIN_SWS_G3.SWSPB2SwStuckL_l = (buf_rec[6] >> 6)
							& 0x01;
					TA531_LIN_SWS_G3.SWSPB3SwStuckL_l = (buf_rec[6] >> 7)
							& 0x01;

					TA531_LIN_SWS_G3.StrgWhlEntrtnSwDataIntgty_l = (buf_rec[7]
							>> 0) & 0x01;  // 新增
					TA531_LIN_SWS_G3.StrgWhlDrvngMdSwA_l = (buf_rec[7] >> 1)
							& 0x01;
					TA531_LIN_SWS_G3.StrgWhlDrvngMdSwDataIntgty_l = (buf_rec[7]
							>> 2) & 0x01;
					TA531_LIN_SWS_G3.StrgWhlTipcSwDataIntgty_l = (buf_rec[7]
							>> 3) & 0x01;
					TA531_LIN_SWS_G3.PadSSelLSwStuck_l = (buf_rec[7] >> 4)
							& 0x01;
					TA531_LIN_SWS_G3.PadSSelRSwStuck_l = (buf_rec[7] >> 5)
							& 0x01;
					TA531_LIN_SWS_G3.RespErSWSF_l = (buf_rec[7] >> 6) & 0x01;

