YanqiS/stm32temp1/main.c
					TSA_Ack_DATA[5] = 1;
					TSA4_0x104_Flag = 1;
					lvLED_Sts_LIN = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x105)	//EBS LIN FrP00 bridge
						{
					EBSBatVol_raw = (uint16_t) (((uint16_t) buf_rec[1] << 8) | buf_rec[0]) & 0x3FFF;
					EBSVolSts_raw = buf_rec[2] & 0x03;
					EBSBatCrntRng_raw = buf_rec[3] & 0x03;
					EBSBatIncnstncyFlag_raw = buf_rec[4] & 0x01;
					EBSRespEr_raw = buf_rec[5] & 0x01;
					TSA_Ack_DATA[6] = 1;
					lvLED_Sts_LIN = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x064)	//TSA_RC1 mm
						{
					TA531_RC1.TA531_RC_X_trg = (int) ((buf_rec[1] << 8)
							+ (buf_rec[0] << 0));
					if ((buf_rec[2] & 0x80) == 0x80) {
						TA531_RC1.TA531_RC_X_Mov = 0 - buf_rec[2];
					} else {
						TA531_RC1.TA531_RC_X_Mov = buf_rec[2];
					}

					TA531_RC1.TA531_RC_Y_trg = (int) ((buf_rec[4] << 8)
							+ (buf_rec[3] << 0));
					if ((buf_rec[5] & 0x80) == 0x80) {
						TA531_RC1.TA531_RC_Y_Mov = 0 - buf_rec[5];
					} else {
						TA531_RC1.TA531_RC_Y_Mov = buf_rec[5];
					}

					TA531_RC1.TA531_RC_Z = (int) (buf_rec[6] << 0);
					TA531_RC1.TA531_RC_Z_code = buf_rec[7] & 0x03;
					TA531_RC1.TA531_RC_Reset = (buf_rec[7] >> 6) & 0x03;

					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg,
							(TA531_RC1.TA531_RC_Reset == 1));

					TA531_RC1_fg = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x065)	//TSA_RC1p %
						{
					TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX0_32b
							+ (int) (buf_rec[0]
									* (ScreenSz_1.DispX1_32b
											- ScreenSz_1.DispX0_32b) / 255);

					if ((buf_rec[2] & 0x80) == 0x80) {
						TA531_RC1.TA531_RC_X_Mov = 0 - buf_rec[2];
					} else {
						TA531_RC1.TA531_RC_X_Mov = buf_rec[2];
					}

					TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY0_32b
							+ (int) (buf_rec[3]
									* (ScreenSz_1.DispY1_32b
											- ScreenSz_1.DispY0_32b) / 255);

					if ((buf_rec[5] & 0x80) == 0x80) {
						TA531_RC1.TA531_RC_Y_Mov = 0 - buf_rec[5];
					} else {
						TA531_RC1.TA531_RC_Y_Mov = buf_rec[5];
					}

					TA531_RC1.TA531_RC_Z = (int) (buf_rec[6] << 0);
					TA531_RC1.TA531_RC_Z_code = buf_rec[7] & 0x03;
					TA531_RC1.TA531_RC_Reset = (buf_rec[7] >> 6) & 0x03;

					Clamp_Position(&TA531_RC1.TA531_RC_X_trg,
							&TA531_RC1.TA531_RC_Y_trg,
							(TA531_RC1.TA531_RC_Reset == 1));

					TA531_RC1_fg = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x531)	//TSA_ACK for RESET
						{
					if ((buf_rec[0] == 0x05) && (buf_rec[1] == 0x31)
							&& (buf_rec[2] == 0x00) && (buf_rec[3] == 0x00)
							&& (buf_rec[4] == 0x00) && (buf_rec[5] == 0x00)
							&& (buf_rec[6] == 0x00) && (buf_rec[7] == 0x00)) {
						Remote_state = 0;
						TA531_Lock = 0;
						lvLED_Sts_LIN = 0;
					}
				}

				// 每帧都发送ACK并清空
				HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Ack_Header,
						TSA_Ack_DATA);
				memset(TSA_Ack_DATA, 0, 8);

			}  // while结束
		}  // if hfdcan == &hfdcan1 结束
	}  // if RxFifo0ITs 结束
}  // 函数结束

void HAL_FDCAN_RxFifo1Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo1ITs) {
	if ((RxFifo1ITs & FDCAN_IT_RX_FIFO1_NEW_MESSAGE) != RESET) {
		if (hfdcan == &hfdcan2) 	//CAN2 Classic CAN
				{
			uint8_t buf_rec[8];

			while (HAL_FDCAN_GetRxFifoFillLevel(&hfdcan2, FDCAN_RX_FIFO1)) {
				HAL_FDCAN_GetRxMessage(&hfdcan2, FDCAN_RX_FIFO1,
						&FDCAN2_RxHeader, buf_rec);
			}

			if (FDCAN2_RxHeader.Identifier == HostID)	//
					{

				uint16_t TeMP = (buf_rec[0] << 3) + ((buf_rec[1] >> 5) & 0x07);
				if (TeMP == M1_ID)	//X
						{

					if ((buf_rec[2] == 0x41) & (buf_rec[3] == 0)
							& (buf_rec[4] == 0) & (buf_rec[5] == 0)
							& (buf_rec[6] == 0) & (buf_rec[7] == 0))//init ok
							{
						MotorInit_M1 = 2;
						MotorCtrl_M1.M_Position = 0;
					} else {
						if ((MotorInit_M1 == 2) & (buf_rec[2] == 0x42))	//X_Position
								{
							MotorCtrl_M1.M_Position = (buf_rec[3]
									+ (buf_rec[4] << 8) + (buf_rec[5] << 16)
									+ (buf_rec[6] << 24)) / 160;

							TA531_RC1.TA531_RC_X_act = -MotorCtrl_M1.M_Position
									- 10;
						}

						if ((buf_rec[7] >> 4) > 0)	//
								{
							MotorERR_M1 = 1;
						}
					}
				} else if (TeMP == M2_ID)	//x
						{
					if ((buf_rec[2] == 0x41) & (buf_rec[3] == 0)
							& (buf_rec[4] == 0) & (buf_rec[5] == 0)
							& (buf_rec[6] == 0) & (buf_rec[7] == 0))//init ok
							{
						MotorInit_M2 = 2;
						MotorCtrl_M2.M_Position = 0;
					} else {
						if ((MotorInit_M2 == 2) & (buf_rec[2] == 0x42))	//X_Position
								{
							MotorCtrl_M2.M_Position = (buf_rec[3]
									+ (buf_rec[4] << 8) + (buf_rec[5] << 16)
									+ (buf_rec[6] << 24)) / 160;
						}

						if ((buf_rec[7] >> 4) > 0)	//
								{
							MotorERR_M2 = 1;
						}
					}
				}

				else if (TeMP == M3_ID)	//y
						{
					if ((buf_rec[2] == 0x41) & (buf_rec[3] == 0)
							& (buf_rec[4] == 0) & (buf_rec[5] == 0)
							& (buf_rec[6] == 0) & (buf_rec[7] == 0))//init ok
							{
//						OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 0, "trigger" );
						MotorInit_M3 = 2;
						MotorCtrl_M3.M_Position = 0;
					} else {
						if ((MotorInit_M3 == 2) & (buf_rec[2] == 0x42))	//X_Position
								{
							MotorCtrl_M3.M_Position = (buf_rec[3]
									+ (buf_rec[4] << 8) + (buf_rec[5] << 16)
									+ (buf_rec[6] << 24)) / 160;

							TA531_RC1.TA531_RC_Y_act = -MotorCtrl_M3.M_Position
									- 10;
						}

						if ((buf_rec[7] >> 4) > 0)	//
								{
							MotorERR_M3 = 1;
						}
					}
				}
			}
		}
	}
}

//void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
//{
//	char *str2;
//	sprintf(str2, "%c", I2CRxData[0]);
//	OLED_SSD1306_ShowString(3 ,0, 1, str2);
//}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	if (htim == &htim6)	//500ms
			{
		temper_flag = 1;

	}
	if (htim == &htim7)	//100ms
			{

		////GPIO	// SW_UP, SW_UP_pre, SW_DW, SW_DW_pre, SW_LEFT, SW_LEFT_pre, SW_RIGHT, SW_RIGHT_pre, SW_BUTTON, SW_BUTTON_pre;
		SW_UP_pre = SW_UP;
		SW_DW_pre = SW_DW;
		SW_LEFT_pre = SW_LEFT;
		SW_RIGHT_pre = SW_RIGHT;
		SW_BUTTON_pre = SW_BUTTON;

			if (HAL_GPIO_ReadPin(SW_UP_GPIO_Port, SW_UP_Pin) == 0) {
				SW_UP = 1;
				if (SW_UP_pre == 1) {
					SW_UP_cnt++;
				} else {
					SW_UP_cnt = 0;
				}
			} else {
				SW_UP = 0;
				SW_UP_cnt = 0;
			}
			if (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin) == 0) {
				SW_DW = 1;
				if (SW_DW_pre == 1) {
					SW_DW_cnt++;
				} else {
					SW_DW_cnt = 0;
				}
			} else {
				SW_DW = 0;
				SW_DW_cnt = 0;
			}
			if (HAL_GPIO_ReadPin(SW_LEFT_GPIO_Port, SW_LEFT_Pin) == 0) {
				SW_LEFT = 1;
				if (SW_LEFT_pre == 1) {
					SW_LEFT_cnt++;
				} else {
					SW_LEFT_cnt = 0;
				}
			} else {
				SW_LEFT = 0;
				SW_LEFT_cnt = 0;
			}
			if (HAL_GPIO_ReadPin(SW_RIGHT_GPIO_Port, SW_RIGHT_Pin) == 0) {
				SW_RIGHT = 1;
				if (SW_RIGHT_pre == 1) {
					SW_RIGHT_cnt++;
				} else {
					SW_RIGHT_cnt = 0;
				}
			} else {
				SW_RIGHT = 0;
				SW_RIGHT_cnt = 0;
			}
			if (HAL_GPIO_ReadPin(SW_BUTTON_GPIO_Port, SW_BUTTON_Pin) == 0) {
				SW_BUTTON = 1;
			} else {
				SW_BUTTON = 0;
			}

		////Sys state

		sys_state++;

